using System;
using System.Collections.Generic;
using System.Linq;
using System.Security.Policy;
using System.Text;
using System.Threading.Tasks;
using SFML.Graphics;
using SFML.Window;

namespace Havier_Than_Air_S
{
    internal class Gita
    {



        /*







        //gita
        static float gitadelay = 2000; //счетчик ракет
        static float G = 0; //счетчик ракет
        static int gitaswitch = 0; //счетчик ракет



        //Пожертвования
        static void donat()
        {
            SetFillColor(Color.Blue);
            DrawSprite(uh61, 840, 300, 1215, 575, 221, 235);
            DrawSprite(uh61, 892 - 610, 430 - 208, 308, 777, 610, 208);
            DrawText(330, 240, "Не хватает денег,", 30);
            DrawText(330, 268, "я дарю Тебе 20000 money. ", 30);
            DrawText(330, 296, "Cкоро разбогатеешь!;) Жми \"K\"!", 30);
            DrawText(330, 335, "Донат и обраная связь  ", 18);
            DrawText(330, 350, "по телефону 89500808627  ", 18);
            DrawText(330, 365, "(сбер: Алексей тимофеевич Б.)", 18);

            if (GetKeyDown(Keyboard.Key.K) == true)
            {
                money = money + 20000;
                donatswitch = 0;
            }

        }
         gitadelay = gitadelay - 1;
        padstoredraw();

        if (gitaswitch == 1 && gitadelay < 0)
        {
            if (G == 1)
            {
                if (podskazkaswitch == 1)
                {
                    DrawSprite(uh61, 850, 300, 484, 535, 205, 235);
                    DrawSprite(uh61, 892 - 610, 430 - 208, 308, 777, 610, 208);
                    SetFillColor(Color.Red);
                    DrawText(330, 265, "Знай же: то, чем пронизано материальное тело, неразрушимо.", 16);
                    DrawText(330, 290, "Никто не может уничтожить бессмертную душу. ", 16);
                    DrawText(330, 330, "(\"Y\" чтобы скрыть)", 16);
                }
            }
            if (G == 2)
            {

                if (podskazkaswitch == 1)

                {
                    DrawSprite(uh61, 850, 300, 484, 535, 205, 235);
                    DrawSprite(uh61, 892 - 610, 430 - 208, 308, 777, 610, 208);
                    SetFillColor(Color.Red);
                    DrawText(330, 260, "Материальное тело вечного, неуничтожимого и", 16);
                    DrawText(330, 290, "неизмеримого живого существа обречено на смерть. ", 16);
                    DrawText(330, 320, "Поэтому сражайся, о потомок Бхараты! ", 16);
                    DrawText(330, 360, "(\"Y\" чтобы скрыть)", 14);

                }

            }
            if (G == 3)
            {

                if (podskazkaswitch == 1)

                {
                    DrawSprite(uh61, 850, 300, 484, 535, 205, 235);
                    DrawSprite(uh61, 892 - 610, 430 - 208, 308, 777, 610, 208);
                    SetFillColor(Color.Red);
                    DrawText(330, 240, "Душа не рождается и не умирает.", 16);
                    DrawText(330, 270, "Она никогда не возникала, не возникает и не возникнет. ", 16);
                    DrawText(330, 300, "Она нерожденная, вечная, всегда существующая и изначальная. ", 16);
                    DrawText(330, 330, "Она не гибнет, когда погибает тело. ", 16);
                    DrawText(330, 370, "(\"Y\" чтобы скрыть)", 14);

                }

            }
            if (G == 4)
            {

                if (podskazkaswitch == 1)

                {
                    DrawSprite(uh61, 850, 300, 484, 535, 205, 235);
                    DrawSprite(uh61, 892 - 610, 430 - 208, 308, 777, 610, 208);
                    SetFillColor(Color.Red);
                    DrawText(330, 245, "Как человек, снимая старые одежды, надевает новые,", 14);
                    DrawText(330, 270, "так и душа входит в новые материальные тела, ", 14);
                    DrawText(330, 295, "оставляя старые и бесполезные. ", 14);

                    DrawText(330, 335, "(\"Y\" чтобы скрыть)", 12);

                }

            }
            if (G == 5)
            {

                if (podskazkaswitch == 1)

                {
                    DrawSprite(uh61, 850, 300, 484, 535, 205, 235);
                    DrawSprite(uh61, 892 - 610, 430 - 208, 308, 777, 610, 208);
                    SetFillColor(Color.Red);
                    DrawText(330, 245, "Душу нельзя рассечь никаким оружием,", 16);
                    DrawText(330, 275, "сжечь огнем, намочить водой ", 16);
                    DrawText(330, 305, "или иссушить ветром.", 16);

                    DrawText(330, 335, "(\"Y\" чтобы скрыть)", 14);

                }

            }
            //string g1 = "Знай же: то, чем пронизано материальное тело, неразрушимо. Никто не может уничтожить бессмертную душу.";
            //string g2 = "Материальное тело вечного, неуничтожимого и неизмеримого живого существа обречено на смерть. Поэтому сражайся, о потомок Бхараты!";
            // string g3 = "Душа не рождается и не умирает. Она никогда не возникала, не возникает и не возникнет. Она нерожденная, вечная, всегда существующая и изначальная. Она не гибнет, когда погибает тело.";
            // string g4 = "Как человек, снимая старые одежды, надевает новые, так и душа входит в новые материальные тела, оставляя старые и бесполезные.";
            // string g4 = "Душу нельзя рассечь никаким оружием, сжечь огнем, намочить водой или иссушить ветром.";


        }
        */

    }
}
